tutorials/old/movingMeshRhoPimpleFoam/rhoPimpleArbitraryFoam/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 293.15;

boundaryField
{
    sides
    {
        type            fixedValue;
        value           uniform 293.15;
    }
    top
    {
        type            fixedValue;
        value           uniform 293.15;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 293.15;
    }
    bottom
    {
        type            fixedValue;
        value           uniform 293.15;
    }
    inlet
    {
        type            fixedValue;
        value           uniform 293.15;
    }
}


// ************************************************************************* //
